import bot from '../../unity/bot';
import { task_base } from './../task_base';
export class everDayTask extends task_base{
    constructor(...a){
        super(...a);
        this.render();
    }
    async render(){
        let temp = `┏┄══🌈每日任务══━┄
☑️[签到]每日签到领奖励(0/1)
☑️[竞猜]欧皇检测器(0/1)
☑️[黑市]查看一次黑市商品(0/1)
☑️[PK]频道PK(0/10)
☑️[捕捉]在地图上抓一次怪物(0/1)
☑️[钓鱼]钓鱼佬绝不空军(0/10)
☑️[技能商店]查看一次技能商品(0/1)
☑️[装备商店]查看一次装备商品(0/1)
☑️[攻击怪物]吃饭睡觉打怪物(0/20)
☑️[攻击boss]全服一起打BOSS(0/3)
☑️[华山论剑]排位PK(0/10)
┗┄━${this.at()}━┄
    🧚‍♂️任务还未完成，继续加油哦~`
    bot.sendText(this.channel_id,temp)
    }
}
/**
┏┄══🌈飞升任务══━┄
☑️击杀等级不相差10级玩家(0/1000)
☑️击杀大于自身等级怪物(0/1000)
☑️击杀一次boss(0/1)
┗┄━@楚轩 ━┄
🧚‍♂️完成任务变化:
1.随机部位最高品质装备
2.在下一个飞升者完成任务前，任意玩家击杀怪物自身获得5%经验
3.地图切换=>怪物等级提高
 */